# Módulo 2
**Desarrollo de proyectos de análisis de datos  IN1002B**

### Tipos de datos, indexación y datos perdidos. 

**Librerías**

Dependiendo de lo que se requiera (manejo de datos, visualización, modelos), debemos importar las librerías necesarias.

In [2]:
import pandas as pd
import numpy as np

**Cargar los datos**

Hay diversas formas de llamar a una base de datos,para este curso utilizaremos la función de ``` pd.read_csv('')``` o bien la de ``` pd.read_excel('')``` de pandas.

Solo deben de tener la precaución de tener su base de datos dentro de la carpeta donde se este haciendo el notebook.

In [2]:
data = pd.read_csv("Data/retail.csv")

**Información general de los datos**

Una parte fundamental es saber como esta estructurada nuestra base de datos, es decir, saber:
* ¿Cuántas columnas tiene?
* ¿Cuántas filas?
* ¿Qué tipo de datos son?
* ¿Hay caractéres especiales?
* ¿Tenemos faltantes?

```info()```

Nos da respuesta a gran parte de las preguntas anteriores, podemos ver las dimensiones de la base y tipos de datos.

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Unnamed: 0             1000 non-null   int64
 1   Store ID               1000 non-null   object
 2   Product ID             1000 non-null   int64
 3   Date                   1000 non-null   object
 4   Units Sold             1000 non-null   int64
 5   Sales Revenue (USD)    1000 non-null   float64
 6   Discount Percentage    1000 non-null   int64
 7   Marketing Spend (USD)  1000 non-null   int64
 8   Store Location         1000 non-null   object
 9   Product Category       1000 non-null   object
 10  Day of the Week        1000 non-null   object
 11  Holiday Effect         1000 non-null   bool
dtypes: bool(1), float64(1), int64(5), object(5)
memory usage: 87.0+ KB

object = texto 

```head()```

Como dice su nombre, esta función nos permite las primeras filas de la base, es muy importante para saber como estan capturados los registros que tenemos.

In [4]:
data.head()

,Unnamed: 0,Store ID,Product ID,Date,Units Sold,Sales Revenue (USD),Discount Percentage,Marketing Spend (USD),Store Location,Product Category,Day of the Week,Holiday Effect
0,20339,Spearsland,93691949,2023-08-26,4,2076.36,0,112,Turkey,Clothing,Saturday,False
1,21879,Spearsland,56655933,2023-11-12,3,167.97,0,121,Malaysia,Furniture,Sunday,False
2,3900,Spearsland,34892534,2022-09-03,10,1644.30,0,9,Togo,Furniture,Saturday,False
3,27620,Spearsland,22571670,2023-07-28,10,1067.00,0,98,Mozambique,Electronics,Friday,False
4,8282,Spearsland,30776388,2022-08-30,6,5821.26,0,127,Nauru,Electronics,Tuesday,False

```isnull()```

Esta función nos ayuda a detectar los faltantes, en conjunto con ```sum()``` la podemos aplicar a la base de datos para ver cuántos valores nos faltan por columna.

In [5]:
data.isnull().sum()

Unnamed: 0               0
Store ID                 0
Product ID               0
Date                     0
Units Sold               0
Sales Revenue (USD)      0
Discount Percentage      0
Marketing Spend (USD)    0
Store Location           0
Product Category         0
Day of the Week          0
Holiday Effect           0
dtype: int64

## **Indexación**  
Cuando necesitamos acceder a los elementos de una columna, podemos acerlo de varias formas:

### **Columnas**

In [6]:
data.Date

0      2023-08-26
1      2023-11-12
2      2022-09-03
3      2023-07-28
4      2022-08-30
          ...
995    2023-04-19
996    2022-01-11
997    2022-09-12
998    2022-04-24
999    2022-06-23
Name: Date, Length: 1000, dtype: object

In [7]:
data['Store ID']

0      Spearsland
1      Spearsland
2      Spearsland
3      Spearsland
4      Spearsland
          ...
995    Spearsland
996    Spearsland
997    Spearsland
998    Spearsland
999    Spearsland
Name: Store ID, Length: 1000, dtype: object

In [8]:
#elementos de la columna 3
data.iloc[:, 3]

0      2023-08-26
1      2023-11-12
2      2022-09-03
3      2023-07-28
4      2022-08-30
          ...
995    2023-04-19
996    2022-01-11
997    2022-09-12
998    2022-04-24
999    2022-06-23
Name: Date, Length: 1000, dtype: object

In [11]:
# Columnas 4 a la 8
data.iloc[0:10, 4:8]

   Units Sold  Sales Revenue (USD)  Discount Percentage  Marketing Spend (USD)
0           4              2076.36                    0                    112
1           3               167.97                    0                    121
2          10              1644.30                    0                      9
3          10              1067.00                    0                     98
4           6              5821.26                    0                    127
5           6              1149.42                    0                     85
6           5               533.50                    0                      0
7          10              6186.51                   10                      0
8           9              4011.75                    0                     27
9           6              5696.40                    0                    133

### **Filas**

In [10]:
data[0:10]

,Unnamed: 0,Store ID,Product ID,Date,Units Sold,Sales Revenue (USD),Discount Percentage,Marketing Spend (USD),Store Location,Product Category,Day of the Week,Holiday Effect
0,20339,Spearsland,93691949,2023-08-26,4,2076.36,0,112,Turkey,Clothing,Saturday,False
1,21879,Spearsland,56655933,2023-11-12,3,167.97,0,121,Malaysia,Furniture,Sunday,False
2,3900,Spearsland,34892534,2022-09-03,10,1644.30,0,9,Togo,Furniture,Saturday,False
3,27620,Spearsland,22571670,2023-07-28,10,1067.00,0,98,Mozambique,Electronics,Friday,False
4,8282,Spearsland,30776388,2022-08-30,6,5821.26,0,127,Nauru,Electronics,Tuesday,False
5,11501,Spearsland,65593523,2023-06-21,6,1149.42,0,85,Cyprus,Groceries,Wednesday,False
6,27173,Spearsland,22571670,2022-05-07,5,533.50,0,0,Guinea-Bissau,Electronics,Saturday,False
7,27929,Spearsland,18794205,2022-06-01,10,6186.51,10,0,Comoros,Clothing,Wednesday,False
8,29013,Spearsland,47345331,2023-05-20,9,4011.75,0,27,North Macedonia,Electronics,Saturday,False
9,24682,Spearsland,24102292,2023-07-14,6,5696.40,0,133,Sri Lanka,Clothing,Friday,False

Si necesitan un conjunto de datos más específico, es de utilidad  ```loc```.
<br>
En el siguiente ejemplo le pedimos que nos muestre los valores de la fila 0 a la 15 de las columnas "CASE_STATUS" y "CASE_RECEIVED_DATE".

In [12]:
# Filas de la 0 a la 14 y dos columnas
data.loc[0:14, ["Store ID", "Date"]]

      Store ID        Date
0   Spearsland  2023-08-26
1   Spearsland  2023-11-12
2   Spearsland  2022-09-03
3   Spearsland  2023-07-28
4   Spearsland  2022-08-30
5   Spearsland  2023-06-21
6   Spearsland  2022-05-07
7   Spearsland  2022-06-01
8   Spearsland  2023-05-20
9   Spearsland  2023-07-14
10  Spearsland  2023-03-09
11  Spearsland  2022-06-12
12  Spearsland  2022-03-23
13  Spearsland  2023-04-11
14  Spearsland  2023-05-26

In [13]:
# o por rangos
data.loc[1:5,'Product ID': 'Marketing Spend (USD)']

,Product ID,Date,Units Sold,Sales Revenue (USD),Discount Percentage,Marketing Spend (USD)
1,56655933,2023-11-12,3,167.97,0,121
2,34892534,2022-09-03,10,1644.30,0,9
3,22571670,2023-07-28,10,1067.00,0,98
4,30776388,2022-08-30,6,5821.26,0,127
5,65593523,2023-06-21,6,1149.42,0,85

## **Tipos de datos**

En python tenemos diferentes tipos de datos, los pueden ver en la función `info()`, algunos de ellos son:

    Object
    float
    int 
    bool 
    category

Podemos tener más clases de objetos, incluso podemos crear, pero para fines de esta clase trabajaremos solo con estos. 

Si desean verlos de manera individual, podemos usar "dtype()"

### **Datos cualitativos**

* Explicación de este tipo de datos

Con la estrucutura de base de datos de pandas, podemos identificar este tipo de valores como `object` o `category`. 
Es importante hacer una impresión de los datos antes, solo para estar completamente seguros.

Unas funciones que nos ayudan mucho en este tipo de datos son: `value_counts()` y `unique()`

```unique()``` : Nos ayuda a identificar los valores únicos en la columna 

```value_counts()```: Nos ayuda a identificar las veces que se repite cada categoría

In [15]:
data['Store Location'].value_counts()

Store Location
North Macedonia             10
Finland                     10
Tokelau                      9
United Arab Emirates         9
Mayotte                      9
                            ..
Moldova                      1
Northern Mariana Islands     1
Gambia                       1
France                       1
British Virgin Islands       1
Name: count, Length: 239, dtype: int64

In [17]:
#normalize
data['Store Location'].value_counts(normalize = True)

Store Location
North Macedonia             0.010
Finland                     0.010
Tokelau                     0.009
United Arab Emirates        0.009
Mayotte                     0.009
                            ...
Moldova                     0.001
Northern Mariana Islands    0.001
Gambia                      0.001
France                      0.001
British Virgin Islands      0.001
Name: proportion, Length: 239, dtype: float64

In [18]:
#unique
data['Store Location'].unique()

array(['Turkey', 'Malaysia', 'Togo', 'Mozambique', 'Nauru', 'Cyprus',
       'Guinea-Bissau', 'Comoros', 'North Macedonia', 'Sri Lanka',
       'Guinea', 'Bahrain', 'Namibia', 'New Caledonia', 'Bermuda',
       'Netherlands Antilles', 'Albania', 'Ghana', 'Timor-Leste',
       'Syrian Arab Republic', 'Falkland Islands (Malvinas)',
       'Saint Pierre and Miquelon', 'Congo', 'Western Sahara',
       'Australia', 'Guadeloupe', 'Cape Verde', 'Marshall Islands',
       'Seychelles', 'Tokelau', 'Iraq',
       'Antarctica (the territory South of 60 deg S)',
       'Antigua and Barbuda', 'Romania', 'Canada', 'Mongolia', 'Botswana',
       'Saint Helena', 'Burkina Faso', 'United Arab Emirates',
       'Christmas Island', 'Saint Vincent and the Grenadines',
       'Luxembourg', 'Greece', 'Faroe Islands', 'Poland', 'Algeria',
       'Cocos (Keeling) Islands', 'Greenland', 'Guyana', 'United Kingdom',
       'Bhutan', 'Mauritania', 'United States Minor Outlying Islands',
       'Montenegro', 'Fiji', 'Paraguay', 'South Africa', 'China',
       'Kyrgyz Republic', 'Libyan Arab Jamahiriya', 'Barbados', 'Grenada',
       'Sao Tome and Principe', 'Saudi Arabia', 'Estonia',
       "Lao People's Democratic Republic", 'Kiribati', 'Mayotte',
       'Gibraltar', 'Netherlands', 'Saint Barthelemy', 'Guam', 'Lesotho',
       'Maldives', 'Madagascar', 'Jersey', 'Saint Martin', 'Ecuador',
       'Denmark', 'Sierra Leone', 'Portugal',
       'South Georgia and the South Sandwich Islands', 'Myanmar',
       'Latvia', 'Equatorial Guinea', 'Haiti',
       'Bouvet Island (Bouvetoya)', 'American Samoa', 'Benin',
       'Dominican Republic', 'Nicaragua', 'Turks and Caicos Islands',
       'Trinidad and Tobago', "Cote d'Ivoire", 'Czech Republic',
       'Hong Kong', 'Samoa', 'Ireland', 'Germany', 'Bolivia', 'Monaco',
       'Japan', 'Aruba', 'French Guiana', 'Egypt', 'Somalia', 'Peru',
       'Norway', 'Nigeria', 'Montserrat', 'Ethiopia', 'Uruguay',
       'Costa Rica', 'Serbia', 'Holy See (Vatican City State)',
       'Lithuania', 'India', 'Yemen', 'Morocco', 'Honduras', 'Sudan',
       'Liberia', 'Swaziland', 'Mauritius', 'El Salvador', 'Guernsey',
       'Macao', 'Philippines', 'Spain', 'Switzerland', 'Hungary',
       'Reunion', 'Korea', 'Vietnam', 'Puerto Rico',
       'Bosnia and Herzegovina', 'Cayman Islands', 'French Polynesia',
       'Heard Island and McDonald Islands', 'Lebanon', 'Rwanda',
       'Jamaica', 'Qatar', 'Slovakia (Slovak Republic)', 'Mali', 'Gabon',
       'Cook Islands', 'Palau', 'Slovenia', 'Tanzania', 'Dominica',
       'Zambia', 'Pakistan', 'Kazakhstan', 'Norfolk Island', 'Finland',
       'Martinique', 'Austria', 'Croatia', 'Palestinian Territory',
       'Afghanistan', 'Bahamas', 'Angola', 'Brazil', 'Russian Federation',
       'Azerbaijan', 'Chile', 'Niue', 'Bangladesh', 'Kuwait', 'Sweden',
       'Israel', 'Venezuela', 'Djibouti', 'Saint Kitts and Nevis',
       'Solomon Islands', 'Indonesia', 'United States of America',
       'Tunisia', 'Guatemala', 'Anguilla', 'Chad', 'Taiwan', 'Micronesia',
       'Kenya', 'Saint Lucia', 'Singapore', 'Brunei Darussalam',
       'Cameroon', 'Jordan', 'New Zealand', 'Central African Republic',
       'Eritrea', 'Belgium', 'Panama', 'Belize', 'Pitcairn Islands',
       'Tajikistan', 'Uzbekistan', 'Cuba', 'Malawi', 'Burundi', 'Vanuatu',
       'Nepal', 'Armenia', 'Turkmenistan', 'Wallis and Futuna',
       'Thailand', 'Tonga', 'Argentina', 'Malta', 'Iran', 'Niger',
       'Suriname', 'Colombia', 'Iceland', 'Zimbabwe',
       'French Southern Territories', 'Tuvalu', 'San Marino', 'Bulgaria',
       'Georgia', 'United States Virgin Islands', 'Mexico', 'Senegal',
       'Liechtenstein', 'Ukraine', 'Belarus', 'Uganda',
       'Papua New Guinea', 'Italy', 'Cambodia', 'Isle of Man', 'Moldova',
       'Northern Mariana Islands', 'Gambia', 'France',
       'British Virgin Islands'], dtype=object)

### **Datos cuantitativos**

* Explicación de este tipo de datos

En comparación con los datos cualitativos, los cuantitativos se reconocen debido a que son del tipo `int` o float`. 

**Discretos vs Contínuos**

Para este tipo de datos nos ayuda la función de `describe()` si los datos son de tipo contínuo. En el caso de que sean discretos nos podemos seguir apoyando de `value_counts()`.

In [19]:
# contínuos
data['Sales Revenue (USD)'].describe()

count     1000.000000
mean      2639.458240
std       2486.036212
min          0.000000
25%        888.600000
50%       1808.010000
75%       3692.655000
max      18353.620000
Name: Sales Revenue (USD), dtype: float64

In [21]:
# discretos
data['Units Sold'].value_counts()

Units Sold
7     135
4     131
6     130
5     123
3     107
9      82
2      63
10     53
8      52
1      36
12     25
11     14
14     11
13     10
15     10
16      5
0       5
18      3
17      2
28      1
19      1
21      1
Name: count, dtype: int64

## **Datos perdidos**

El trabajo de datos perdidos depende de cada base de datos, por lo que no tenemos una guía que aplique a todo. 
<br>
Antes de remplazar algun valor primero debemos revisar:
* ¿Es posible remplazar ese valor con otro?
  
1. La tienda abre de 1 a 9
2. La tienda no abre
3. NaN

* ¿Cuántos faltantes tenemos?
1. Base de datos de 1,000,000 con 56,000 faltantes
2. Base de datos de 100 con 30 faltantes. 

* ¿Qué lógica deberá de seguir el remplazo?


En caso de que si puedas hacer un remplazo, la pregunta más importante será la tercera. 

Para estos ejemplos trabajaremos con la base de datos de `bike_buyers.csv`

In [3]:
bike = pd.read_csv('Data/bike_buyers.csv')

In [4]:
# info()
bike.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ID                1000 non-null   int64
 1   Marital Status    993 non-null    object
 2   Gender            989 non-null    object
 3   Income            994 non-null    float64
 4   Children          992 non-null    float64
 5   Education         1000 non-null   object
 6   Occupation        1000 non-null   object
 7   Home Owner        996 non-null    object
 8   Cars              991 non-null    float64
 9   Commute Distance  1000 non-null   object
 10  Region            1000 non-null   object
 11  Age               992 non-null    float64
 12  Purchased Bike    1000 non-null   object
dtypes: float64(4), int64(1), object(8)
memory usage: 101.7+ KB

In [5]:
# isnull()

bike.isnull().sum()

ID                   0
Marital Status       7
Gender              11
Income               6
Children             8
Education            0
Occupation           0
Home Owner           4
Cars                 9
Commute Distance     0
Region               0
Age                  8
Purchased Bike       0
dtype: int64

Vamos a hacer una copia de respaldo, para tener los valores originales a la mano en caso de ser necesario.

In [6]:
respaldo = pd.read_csv('Data/bike_buyers.csv')

Ahora continuemos con la base de `bike`.
<br>
Nor iremos por orden, la primera columna es `Marital Status`:

In [7]:
#value_counts()
bike['Marital Status'].value_counts()

Marital Status
Married    535
Single     458
Name: count, dtype: int64

`fillna()`

Esta función buscará todos los faltantes del conjunto de datos que señales. Solo necesitas declarar como argumento de entrada `()` con que valor remplazaras los faltantes. El valor puede ser **numérico** o tipo **texto**

Vamos a remplazar con la leyenda:
    
    'Sin registro'

In [8]:
bike['Marital Status'].fillna('Sin registro', inplace = True)

#inplace evita esto:
# bike['Marital Status'] = bike['Marital Status'].fillna('Sin registro')

In [9]:
#value_counts() / unique()
bike['Marital Status'].value_counts()

Marital Status
Married         535
Single          458
Sin registro      7
Name: count, dtype: int64

`replace`

La lógica es la misma que `fillna`, solo que `replace` no se enfoca solo a los datos faltantes.

Vamos a recuperar la columna original de `Marital Status`:

In [11]:
bike['Marital Status'] = respaldo['Marital Status'] 
#unique()
bike['Marital Status'].unique()

array(['Married', 'Single', nan], dtype=object)

Lo que vamos a hacer es apoyarnos de numpy con `np.nan`.

In [12]:
bike['Marital Status'].replace(np.nan,'Sin registro', inplace = True)

In [13]:
#value_counts()
bike['Marital Status'].unique()

array(['Married', 'Single', 'Sin registro'], dtype=object)

***loc() - iloc()***

`loc` = Acceder a los valores por medio del nombre: CASE_STATUS


`iloc` = Acceder a los valores por la ubicación de los valores $data[3]$

`ffill`

Este es un método de **propagación** de valores de la función `fillna()` por medio del argumento `method`
<br>
Lo que hace es tomar el valor inmediato anterior y colocarlo donde hay un faltante:

A
B
C
nan


A
B
C
C

In [14]:
# Vamos a colocar los datos originales
bike['Marital Status'] = respaldo['Marital Status']

In [15]:
#unique()
bike['Marital Status'].unique()

array(['Married', 'Single', nan], dtype=object)

In [16]:
#head(10)
bike['Marital Status'].head(10)

0    Married
1    Married
2    Married
3     Single
4     Single
5    Married
6     Single
7    Married
8        NaN
9    Married
Name: Marital Status, dtype: object

In [17]:
#ffill
bike['Marital Status'].fillna(method = 'ffill', inplace = True)

/tmp/ipykernel_632/1689592096.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  bike['Marital Status'].fillna(method = 'ffill', inplace = True)

In [18]:
bike['Marital Status'].head(10)

0    Married
1    Married
2    Married
3     Single
4     Single
5    Married
6     Single
7    Married
8    Married
9    Married
Name: Marital Status, dtype: object

**Moda**

Por el tipo de dato que tenemos también podemos aplicar la moda, para esto vamos a seguir apoyandonos de la función `fillna()` y tambien de `mode()`

In [ ]:
# Vamos a colocar los datos originales

bike['Marital Status'] = respaldo['Marital Status']

In [ ]:
#moda
moda = bike['Marital Status'].mode()[0]
moda

Para obtener el valor de moda directamente, necesitas acceder al primer elemento con [0] porque mode() devuelve una Series

In [ ]:
# fillna

# head()

**dropna()**

En caso de que no pueda realizarse algun remplazo, se recomienda eliminar los faltantes, esto también lo podemos hacer especificando la columna que estamos analizando:

In [ ]:
bike.shape

Podemos hacer una eliminación **general** de los faltantes.

In [ ]:
bike.dropna(inplace = True)

In [ ]:
bike.shape

Usemos la copia que teniamos generada

In [ ]:
bike = respaldo 
bike.info()

O bien especificar a que columnas deseamos aplicar la función:

In [ ]:
#bike.dropna(subset = ['Age', 'Cars'], inplace = True)
bike.dropna(subset = ['Home Owner', 'Income'], inplace = True)

In [ ]:
bike.shape

In [ ]:
#isnull()
bike.isnull().sum()

* ¿Cuál consideran que es la mejor opción para la columna de estatus marital?

* ¿Las técnicas que empleamos anteriormente son igualmente aplicables a `Income`, `Children` y `Age`?

**Media**

Es una de las formas más utilizadas para hacer el remplazo de valores, la forma en que se aplica es similar a la de la moda (`mode()`).

En este ejemplo vamos a trabajar con `Income`:

In [ ]:
mean = bike.Income.mean()
mean

In [ ]:
#o bien -> describe()
bike.Income.describe()

In [ ]:
mean = 

bike['Income'].fillna(mean, inplace = True)

También podrían hacer lo siguiente:
    
    bike['Income'].fillna(bike['Income'].mean(), inplace= True)
    
Pero ¿que pasaría si intentan aplicar esa misma lógica a la columna de `Children`?

In [ ]:
mean2 = bike.Children.mean()
mean2

¿Es correcto?

Cuando tenemos variables tipo **discretas** no debemos hacer divisiones que nos arrojen valores tipo *float*.
<br>
En caso de que tengan este tipo de valores y requieran aplicar la media, solo necesitan hacer el siguiente ajuste:

In [ ]:
mean2 = round(mean2)
mean2

In [ ]:
bike['Children'].fillna(mean2, inplace = True)

En caso de que requieran analizar la mediana, la lógica permanece igual:

    mediana = bike['Children'].median()

Solo asegurense de imprimir el valor con el que estarán haciendo el remplazo para ver que tenga sentido con: formato, valor y estructura de la columna.

## **Tipo de dato**

En esta últia sección, vamos a eliminar los faltantes de toda la base de datos como primer paso:

In [ ]:
df = pd.read_csv("bike_buyers.csv")
df.info()

In [ ]:
#isnull

df.isnull().sum()

In [ ]:
df.dropna(inplace=True)
df.shape

In [ ]:
df.head()

### **Cambio de tipo de dato**

In [ ]:
df.Children = df.Children.astype('int')

In [ ]:
#head()

**Multiples columnas**

In [ ]:
df = df.astype({'': 'int32', '': 'float64'})

In [ ]:
# head()

**Otros casos**

En algunas ocasiones, la columa puede tener un dato erroneo o mal capturado.
Imaginemos que tenemos la siguiente lista:

```Age = [24.0, 25.0. 'treinta', 30.0]```

Al aplicar la función, python detectara un error debido a que 'treinta' no es un valor que se pueda convertir directamente a entero.

En esos casos podemos aplicar lo siguiente:

In [ ]:
Age = [24.0, 25.0, 'treinta', 30.0]
Age = pd.Series(Age)

Age = pd.to_numeric(Age, errors='coerce').fillna(0).astype(int)

print(Age)

```to_numeric``` es una función de **inferencia**, la cual determina el mejor tipo númerico para los datos a analizar.

En este caso **coerce** pide forzar una conversión a otro tipo de dato que permita continuar con el proceso, de esta forma "treinta" se convierte en NaN (Not a number), luego aplicamos ```fillna(0)``` y esos valores son ahora igual a 0.

### **Categorías no utilizadas**

En estos casos, utilizaremos ```value_counts()```, despues trabajaremos con funciones que lo hagan más rápido:

In [ ]:
# head()

In [ ]:
# 'Marital Status'

In [ ]:
# 'Education'

Hay diferentes métodos para eliminar estos valores:

1. Se genera una serie boleana donde *"Partial High School"* es igual a **False** y el resto de las categorías es igual a **True**, así que 
lo que pedimos es que solo considere aquellas filas donde el valor sea **True**.

In [ ]:
df_cleaned = df[df['Education'] != 'Partial High School']

2. Con la función ```drop()``` somos un poco más especificos y pedimos que elimine todos los valores *'Partial High School'¨* de la columa *Education*.

In [ ]:
# df.drop(df[df['Education'] == 'Partial High School'].index, inplace=True)

Por último, impriman un ```shape```, ```info()``` o ```head()``` y vean su bas de datos final: